In [1]:
import pandas as pd

In [2]:
df_one = pd.DataFrame({
    'k1': ['A','A','B','B','C','C'],
    'col1': [100, 200, 300, 300, 400, 500],
    'col2': ['NY', 'CA', 'WA', 'WA', 'AK', 'NV']
})

In [3]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [5]:
df_one['col1'].unique()

array([100, 200, 300, 400, 500])

In [6]:
df_one['col2'].unique()

array(['NY', 'CA', 'WA', 'AK', 'NV'], dtype=object)

In [7]:
df_one['col1'].nunique()

5

In [8]:
df_one['col2'].nunique()

5

In [9]:
df_one.value_counts()

k1  col1  col2
B   300   WA      2
A   100   NY      1
    200   CA      1
C   400   AK      1
    500   NV      1
dtype: int64

In [10]:
df_one.drop_duplicates()

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [12]:
df_one

  k1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [13]:
def grab_first_letter(section):
    return section[0]

In [14]:
grab_first_letter('NY')

'N'

In [17]:
df_one['fist letter'] =df_one['col2'].apply(grab_first_letter)

In [18]:
df_one

  k1  col1 col2 fist letter
0  A   100   NY           N
1  A   200   CA           C
2  B   300   WA           W
3  B   300   WA           W
4  C   400   AK           A
5  C   500   NV           N

In [20]:
my_map = {'A': 1, 'B': 2, 'C': 3}
df_one['num'] = df_one['k1'].map(my_map)

In [21]:
df_one

  k1  col1 col2 fist letter  num
0  A   100   NY           N    1
1  A   200   CA           C    1
2  B   300   WA           W    2
3  B   300   WA           W    2
4  C   400   AK           A    3
5  C   500   NV           N    3